Python 3.8.8 (tags/v3.8.8:024d805, Feb 19 2021, 13:18:16) [MSC v.1928 64 bit (AMD64)] on win32
Type "help", "copyright", "credits" or "license()" for more information.
>>> import urllib.request as url
>>> url.urlopen("https://www.jansatta.com/")
<http.client.HTTPResponse object at 0x0000023BFD01B2B0>
>>> response = url.urlopen("https://www.jansatta.com/")
>>> import bs4
>>> page = bs4.BeautifulSoup(response)
Traceback (most recent call last):
  File "<pyshell#4>", line 1, in <module>
    page = bs4.BeautifulSoup(response)
  File "C:\Python38\lib\site-packages\bs4\__init__.py", line 309, in __init__
    markup = markup.read()
  File "C:\Python38\lib\http\client.py", line 465, in read
    return self._readall_chunked()
  File "C:\Python38\lib\http\client.py", line 575, in _readall_chunked
    value.append(self._safe_read(chunk_left))
  File "C:\Python38\lib\http\client.py", line 612, in _safe_read
    data = self.fp.read(amt)
  File "C:\Python38\lib\socket.py", line 669, in readinto
    return self._sock.recv_into(b)
  File "C:\Python38\lib\ssl.py", line 1241, in recv_into
    return self.read(nbytes, buffer)
  File "C:\Python38\lib\ssl.py", line 1099, in read
    return self._sslobj.read(len, buffer)
ConnectionResetError: [WinError 10054] An existing connection was forcibly closed by the remote host
>>> response = url.urlopen("https://www.jansatta.com/")
>>> page = bs4.BeautifulSoup(response)
>>> page.find('h3', attrs = {'class' : 'entry-title'})
<h3 class="entry-title"><a href="https://www.jansatta.com/international/us-military-operation-in-troubled-afghanistan-ends-america-leaves-before-deadline/1803020/" rel="bookmark">संकटग्रस्त अफगानिस्तान में खत्म हुआ US सैन्य अभियान, डेडलाइन से पहले ही निकल गया अमेरिका</a></h3>
>>> title = page.find('h3', attrs = {'class' : 'entry-title'})
>>> title.text
'संकटग्रस्त अफगानिस्तान में खत्म हुआ US सैन्य अभियान, डेडलाइन से पहले ही निकल गया अमेरिका'
>>> titles = page.find_all('h3', attrs = {'class' : 'entry-title'})
>>> len(titles)
151
>>> for i in range(len(titles)):
	print(titles[i].text)

	
संकटग्रस्त अफगानिस्तान में खत्म हुआ US सैन्य अभियान, डेडलाइन से पहले ही निकल गया अमेरिका
UPA-2 के मुकाबले NDA सरकार में मुस्लिमों को मिली अधिक छात्रवृत्ति, फिर मोदी मुसलमान विरोधी कैसे?- पुरानी खबर शेयर कर बोले BJP सांसद
भगवान श्रीकृष्ण की नगरी मथुरा में मीट और शराब पूरी तरह बैन- योगी सरकार का फैसला
गैर-हिंदुओं की कार पार्किंग पर यहां मंदिर ने लगाई रोक, विवाद
इंदौर पिटाई कांड का पाक से कनेक्शनः बोले HM-विरोध करने वाला ओवैसी का आदमी, फेसबुक के जरिए रच रहा था साजिश
एक के बाद एक महाराष्ट्र के नेताओं पर कस रहा ED का शिकंजा, देशमुख- खडसे के बाद अब भावना गवली के खिलाफ कार्रवाई
सेना में जाना चाहते थे राजा भैया, पिता को था डर कि पढ़-लिखकर बुजदिल ना बन जाए बेटा
अफगानिस्तान ने कहा: अपने आपसी झगड़े में हमें न घसीटें भारत-पाक, ओसामा बिन लादेन का खास साथी भी नांगरहार लौटा
योगी आदित्यनाथ से फोन पर हो जाती है बात, लेकिन अखिलेश यादव से नहीं हो पाती – मंच पर छलक उठा शिवपाल सिंह यादव का दर्द
ये चलाएंगे देश को, जिन पर पाकिस्तान ताली ठोक रहा- तालिबान का वीडियो दिखा बोलीं अंजना ओम कश्यप तो पाक पैनलिस्ट से मिला ये जवाब
गठबंधन में बढ़ रही रार, उद्घाटन कार्यक्रम में पहुंचे केंद्रीय मंत्री, नीतीश को न बुलाने से नाराज जदयू कार्यकर्ताओं ने जलाए पोस्टर
Blood Sugar कंट्रोल करने में मददगार हो सकता है चुटकी भर अजवाइन, कई हेल्थ प्रॉब्लम्स को रखता है दूर
मुकेश अंबानी खरीदने जा रहे हैं यूरोपि‍यन कंपनी, सोलर पैनल बनाने का करती है काम
इस राशि की लड़कियां होती हैं खुशमिजाज, किसी का भी जीत लेती हैं दिल, पार्टनर के लिए होती हैं भाग्यशाली
एक किसान की जान चली गई और…DM ने किया सिर फोड़ने का आदेश देने वाले अफसर का बचाव तो बिफरे बॉलीवुड एक्टर
महाराष्ट्रः दही हांडी उत्सव पर लोग नहीं बना सकेंगे पिरामिड, शिवसेना सरकार ने जमावड़े पर लगाई रोक
सह-शिक्षा के खिलाफ जमीयतः कहा- गैर-हिंदू बच्चियों को अनैतिकता से बचाएं, लड़कों के साथ न पढ़ाएं
CGPSC Recruitment 2021: इन पदों पर भर्ती के लिए नोटिफिकेशन जारी, यह उम्मीदवार कर सकेंगे आवेदन
नाली वाली गैस के बाद नई खोज- उत्तराखंड के मंत्री बोले- APP के जरिये कर सकेंगे बारिश को कंट्रोल तो लोग लेने लगे मज़े
राजा भैया के पिता ने बेटे के लिए कभी नहीं मांगा वोट, जानें कौन हैं भदरी रियासत के महाराजा उदय प्रताप सिंह
‘मैं अपने स्टारडम को भुना ना सका..’, जब सबके सामने छलक पड़ा था धर्मेंद्र के छोट बेटे बॉबी देओल का दर्द
गेस्ट हाउस कांड : उखेंगे गड़े मुर्दे, फिल्म ‘मैडम चीफ मिनिस्टर’ में दिखी राजनैतिक वर्चस्व की असली जंग
‘लैपटॉप नहीं मिलेगा, तो देख लेंगे आपको..’ , जब अखिलेश यादव को फोन कर धमकियां और गाली देने लगा था युवक
The Kapil Sharma Show: बेटी रिद्धिमा के साथ शो में नज़र आएंगी नीतू कपूर, कपिल संग तस्वीर शेयर कर कही ये बात
करीना के साथ काम करना चाहते थे बॉबी देओल, ‘बेबो’ ने करवा दिया था रिप्लेस, डायरेक्टर से नाराज़ हो गए थे धर्मेंद्र
बिग बॉस के घर में जन्माष्टमी की धूम, पहले नहीं देखा होगा शमिता शेट्टी का ये रूप
‘चटक मटक’ हिट के बाद फिर छाईं रेणुका-सपना चौधरी, ‘घूम घाघरा’ को 3 दिन में मिले इतने व्यूज
फिल्म समीक्षा- चेहरे: एक चेहरे में कई चेहरे
Shershaah Movie Review: प्यार, फर्ज और कुर्बानी की मिसाल ‘शेरशाह’, दिल छू लेगी ‘विक्रम बत्रा’ की कहानी
अवनि लेखरा : हौसलों को नहीं डिगा पाई रीढ़ की चोट
टोक्यो से भारत आई एक और खुशखबरी, पैरालंपिक्स में सुमित अंतिल ने जैवलिन थ्रो में जीता गोल्ड मेडल; 3 बार तोड़ा विश्व रिकॉर्ड
अवनि लेखरा : हौसलों को नहीं डिगा पाई रीढ़ की चोट
‘भईया ये 20 सितंबर कब आएगा?’ युजवेंद्र चहल ने विराट कोहली से पूछा सवाल तो कुलदीप यादव ने ऐसे लिए मजे
टोक्यो से भारत आई एक और खुशखबरी, पैरालंपिक्स में सुमित अंतिल ने जैवलिन थ्रो में जीता गोल्ड मेडल; 3 बार तोड़ा विश्व रिकॉर्ड
सुप्रीम कोर्ट में एक साथ नौ जजों के शपथ का रिकॉर्ड, दुनिया में नए वैरिएंट की दस्तक।
शिल्पा शेट्टी के दोस्त ने किए उनके निजी जीवन के खुलासे, कोरोना को लेकर जानिए वैज्ञानिकों के predictions.
Tokyo paralympic 2020 में भारत का शानदार प्रदर्शन, Stuart Binny ने लिया क्रिकेट से सन्यास।
12वीं पास हैं Uddhav तो Yogi Adityanath हैं ग्रेजुएट, कितने पढ़े हैं इन 10 राज्यों के मुख्यमंत्री
किसानों पर लाठीचार्जः करनाल DM ने माफी मांगी, CM ने झड़प के लिए पंजाब सरकार को बताया जिम्मेदार; बोले किसान- सॉरी से न चलेगा काम, करें बर्खास्त
करनाल केसः TMC की महुआ ने सिर फोड़ने की बात करने वाले SDM की जूती चाटने वालों से कराई तुलना
e-SHRAM क्या है और किसके आएगा काम? जानें- रजिस्ट्रेशन का तरीका भी
चूक का फायदा
JNU का नया कोर्सः “जिहादी आतंकवाद” है “कट्टरपंथी-धार्मिक आतंकवाद” का एकमात्र रूप
अब असम कांग्रेस में सेंध, 500 वर्करों ने थामा टीएमसी का दामन, सुष्मिता देव ने की तोड़फोड़
बंगालः CM ममता बनर्जी को जान से मारने की धमकी देने का आरोप, कलकत्ता विवि के प्राध्यापक पर केस
एनएमपी पर राहुल, ममता हुए मोदी सरकार पर हमलावर तो सीतारमण ने पलटवार कर पूछा मोनेटाइजेशन का मतलब
पश्चिम बंगालः बीजेपी MLA के लापता होने से हड़कंप, 6 घंटे बाद थाने में मिलीं, बोलीं-पति से हुई थी अनबन
केंद्रीय मंत्री बोले, सांवले थे रवींद्रनाथ टैगोर इसलिए गोद में नहीं उठाती थीं मां; TMC का पलटवार- ऐसी बेकार बातों के चलते ही BJP की ये हालत
कोरोना और राजनीति: महाराष्ट्र में मंदिर खुलवाने पर अड़ी बीजेपी, दिल्ली में स्कूल खोलने के विरोध में
शिवसेना MP भावना गवली के ठिकानों पर ED की रेड; राउत ने कहा- एजेंसी के नोटिस “डेथ वारंट” नहीं, बल्कि “प्रेम-पत्र”
जब राणे को गिरफ्तार करने पहुंची मुंबई पुलिस तो खाना खा रहे थे केंद्रीय मंत्री, उलझते रहे हाथ में थाली लिए
एलगार परिषद केस: पुणे पुलिस ने कही थी PM की हत्या की साज़िश की बात, NIA ने नहीं किया जिक्र
बाइक पर बैठा था युवक, पुणे ट्रैफिक पुलिस ने हवा में लटका दिया! क्रेन से टंगा युवक छोड़ने की लगाता रहा गुहार
पहली बार ISRO से बाहर निजी कंपनियां बनाएंगी PSLV, गौतम अडानी भी दौड़ में
बेंगलुरु में बदमाश ने महिला से छीन ली सोने की 7.5 ग्राम की चेन, पुलिस ले गई डॉक्टर के पास तो केला खिलाकर किया पेट से बाहर
IPL 2021: विराट कोहली की टीम ने उस श्रीलंकाई ऑलराउंडर संग किया करार, जिसने बर्थडे पर टीम इंडिया के छुड़ाए थे छक्के
‘चंद्रयान-2’ ने चंद्रमा पर खोजी पानी के अणुओं की मौजूदगी, ‘चंद्रयान-1’ के आंकड़ों से भी मिली थी ऐसी जानकारी
कर्नाटकः बेगुर झील के बीच बना दी शिव प्रतिमा, हाई कोर्ट भी हैरान, दिए जांच के आदेश
न वह बेहद ग़रीब थी और न ही असहाय। फिर यह निर्वासन वह क्यों झेल रही थी?
नारायण राणे ने दी उद्धव सरकार को धमकी, बोले- एक-एक कर खुलेगी पोल, सब पता किसने करवाया था ‘एसिड अटैक’
रेप के आरोपी को मिली जमानत, कोर्ट बोला- लिव इन रिलेशनशिप यह बताने के लिए काफी, मर्जी से बने शारीरिक संबंध
गरीबी से तंग महाराष्ट्र के किसान ने लिखी कलेक्टर को चिट्ठी, बोला- सामान्य फसलों से नहीं हो रही कमाई, गांजा उगाने की परमिशन दें
Udhav vs Rane: ‘करारा जवाब मिलेगा’, नारायण राणे के बेटे का ट्वीट वायरल
अति सुरक्षा वाले भवन में रिवाल्वर लेकर घुसा और मार ली खुद को गोली, कहानी IAS रजनीश दुबे के निजी सचिव की
UP चुनावों से पहले कांग्रेस को झटका, सीनियर नेताओं ने इस्तीफा देकर अजय लल्लू पर लगाया आरोप, कहा- प्रियंका गांधी से शिकायत पर भी नहीं हुई सुनवाई
सपा बसपा के ब्राह्मण कार्ड खेलने पर भड़के कलराज, बोले- आंखों में धूल झोंकने का काम कर रहे दोनों
कोतवाली में बंद पूर्व IPS अमिताभ ठाकुर से मिलने पहुंचीं पत्नी, पुलिस से हुई तकरार
घर से लुंगी-बनियान ले निकले थे ओपी राजभर, बोले- 19 साल तक लोगों से मांगकर खाया; पत्रकार ने टोका- घुमाते रहते हैं, आपका कुछ किसी को समझ नहीं आता
शौचालय में चोरी की है अजीब सनक, चुराता है एक जरूरी चीज, जानें क्या है वह
राजस्थानः ‘फकीर’ की पिटाई, कहा- PAK जाओ; ओवेसी बोले- ये कमतरी गोडसे की हिंदुत्ववादी सोच का नतीजा
11 करोड़ रुपए के सिक्कों का हुआ गबन, गिनती कर रही कंपनी के मैनेजर को जान से मारने की धमकी,  SBI के कई कर्मचारी जांच के लपेटे में
ये है अटूट बंधनः भाई ने बुलाया था घर, पर अधूरी रह गई बहन की कसक, तो अस्थिफूल पर राखी बांध पूरा किया वादा
नहीं भागूंगी लिखकर देने वाली दुल्हन 15 दिन में भागी! 3 महीने में की तीसरी शादी, चौथी की कर रही तैयारी
गुजरातः श्रीकृष्ण के आपत्तिजनक चित्रण का आरोप, आगबबूला बजरंग दल कार्यकर्ताओं ने दुकान के बाहर जला दी किताब
भाविनाबेन पटेल की जिंदगी की बैसाखी बना भारत का यह पूर्व क्रिकेटर, शादी के बाद से सिल्वर जीतने तक का सफर नहीं था आसान
जब तक हिंदू बहुसंख्यक तब तक चलेगी संविधान, धर्मनिरपेक्षता व कानून की बात- गुजरात के डिप्टी CM का बयान
PM Modi Atul Karwal IPS: अतुल करवाल, वो अधिकारी जिसने नरेंद्र मोदी को याद दिला दिए थे नियम, पीएम ने खुद याद कर की थी IPS की तारीफ
7th Pay Commission: यहां के इन कर्मचारियों के लिए खुशखबरी! सरकार ने दे दी NPA को मंजूरी
‘मैं तमिल हूं कन्नड़ नहीं’, जयललिता के इस बयान के बाद उन्हें मारने के लिए पहुंच गई सैकड़ों की भीड़
हिरोइन, नेता की पत्नी से लेकर 109 साल की दादी तक को डेट कर चुके हैं चेन्‍नई के सुंदर, 365 का रखा है टारगेट
मद्रास HC का केंद्र से सवाल- यूपी-बिहार के मुकाबले तमिलनाडु-आंध्र प्रदेश में लोकसभा सीटें कम क्यों?
खुद पिंजरा खोल उड़ गया एक अफ्रीकी तोता; परेशान मालिक लगा रहा पुलिस के चक्कर, ईनाम भी आया न काम
ISRO ने लॉन्च किया धरती पर निगरानी रखने वाला सैटलाइट, इस बात से चिंता में वैज्ञानिक
7th Pay Commission: यहां CM ने कहा- कर्मचारियों को 28% महंगाई भत्‍ता देगी सरकार
नोएडा को मॉडर्न बनाना चाहते हैं सीएम योगी; पड़ोसी गाजियाबाद बेहाल, बना दुनिया का सबसे प्रदूषित शहर
तालिबान की धमक के बीच यूपी के देवबंद में एटीएस सेंटर बनाने का ऐलान, तेज तर्रार अफसर होंगे तैनात
कोरोनाः मैं-मेरी पूरी टीम आ गए थे चपेट में, पर दायित्व निभाए, विपक्ष जनता को उसके हाल पर छोड़ क्वॉरंटीन था- बयान पर CM योगी ट्रोल
MSP पर फसलों की खरीद में अनियमितता : राकेश टिकैत; किसान नेता ने की सीबीआई जांच की मांग
ट्वीट्स से हमला: किसान विरोधी हरियाणा है या पंजाब? पहल गिना कर खट्टर ने पूछा अमरिंदर से
मेरे पास कोई आए तो सिर फूटा होना चाहिए उसका, उठा-उठा के मारना सबको- करनाल में खट्टर के कार्यक्रम से पहले ये ऑर्डर देने वाले IAS की सफाई से सरकार संतुष्ट!
3 साल में सिर्फ रोड एक्सीडेंट में पंजाब ने गंवाये 15000 करोड़, NH के हर किलोमीटर पर औसत होती है 0.5 की मौत
7th Pay Commission: इस सरकार ने कर्मचारियों का बढ़ा दिया 15% मूल वेतन, कुछ भत्ते भी फिर बहाल करने का किया ऐलान
पंजाब में नवजोत सिंह सिद्धू और कैप्टन के बीच रार, कांग्रेस बोली- अमरिंदर की अगुआई में लड़ेंगे 2022 का चुनाव
किसान महापंचायत में खट्टर सरकार को 6 सितंबर की डेडलाइन, FIR न करने पर सचिवालय के घेराव का ऐलान
हरियाणा में CM को मर्सिडीज, तो चौटाला को लैंडक्रूजर, गाड़ियों के लिए 5 करोड़ का बजट; कांग्रेस का तंज- माल-ए-मुफ्त, दिल-ए-बेरहम
हरियाणा के CM मनोहर लाल खट्टर ने नीरज चोपड़ा को दिया स्पेशल ऑफर, ओलंपिक गोल्ड मेडलिस्ट ने कहा- मैं इस बारे में सोचूंगा
नीरज चोपड़ा ने बीच में ही छोड़ा स्वागत समारोह, पिता से नहीं मिल पाए, मां नहीं खिला पाईं चूरमा; ये है वजह
खट्टर सरकार 7 जिलों में नहीं फहराएगी तिरंगा, अंबाला में HM के विरोध के बाद बवाल
बिहारः अपने नेताओं के लिए JDU ने बनाया ऐप, कुशवाहा बोले- अच्छा करने वाले होंगे सम्मानित
बिहार: नीतीश ने बटन दबा के किया 220 करोड़ के हाईवे का उद्घाटन, उधर गड्ढे में तैर रही थीं मछलियां, मामला कोर्ट ले जाने की तैयारी
बिहार: अब शुरू हो सकेंगी सभी तरह की व्यावसायिक, शैक्षिक गतिविधियां; कोविड के सक्रिय मामलों के घटने पर सरकार का फैसला, धार्मिक उत्सव की भी छूट
नीतीश कुमार ने की तेजस्वी यादव की तारीफ, नर्वस हुई BJP
केंद्रीय मंत्री की सुरक्षा में चूक! पशुपति कुमार पारस के काफिले पर फेंका गया मोबिल ऑयल, कपड़ों पर भी पड़े छीटें
विकास दुबे मुठभेड़ की नहीं हुई निष्पक्ष जांच- सुप्रीम कोर्ट के निर्देश पर बने पैनल ने कहा, UP सरकार और उसके वकील पर भी उठाए सवाल
UP: मां ने रिश्तेदारी में शादी करने से मना किया, युवती ने दुपट्टे से फांसी लगा दे दी जान
कानपुर में मुस्लिम की पिटाई केसः बोला बजरंग दल- ये मुगलकाल नहीं, हिंदू होंगे परेशान तो न बैठेंगे शांत
कानपुर की सभा में जुटे थे 10000 लोग
देखिए, कानपुर में रिटायर्ड फौजी की बदमाशों ने की सरेआम पिटाई, मुख्य आरोपी है हिस्ट्रीशीटर
23 लाख रुपये से अधिक ठगी के एक मामले में अमरपुर के रामकिशोर ईश्वर विगत एक साल से न्याय के लिए दरदर भटकने को मजबूर
जातीय जनगणना ले आई नीतीश कुमार-तेजस्वी यादव को साथ, अगड़े-पिछड़े की लड़ाई के लिए PM से की मुलाकात
जनता दरबार लगाने से हमें कोई रोक लेगा क्या?- बोले तेजप्रताप तो छोटे भाई-बड़ी बहन ने दिया अनुशासन पर ज्ञान; लालू शांत करा पाएंगे घमासान?
पिस्तौल लेकर झंडा फहराने गया पूर्व भाजपा नेता, फायरिंग करते फोटो वायरल; हुआ एक्शन
मरीजों को पूड़ी-सब्जी, अफसरों ने खाई खीर-पूड़ी; भेदभाव का वीडियो वायरल हुआ तो डीएम हुए सख्त, मांगा जवाब
Honda Civic: जीरो डाउन पेमेंट पर 1.5 लाख में खरीदें, मिलेगी 6 महीने की वारंटी और मनी बैक गारंटी
बस 9 हजार डाउन पेमेंट पर खरीदें 80 kmpl माइलेज वाली Hero Glamour, इतनी बनेगी मंथली EMI
1 अक्टूबर से ऑटो डेबिट पेमेंट सिस्टम हो रहा लागू, बैंक अकाउंट में मोबाइल नंबर करवा लें अपडेट
जीरो डाउन पेमेंट पर 1.5 लाख में ये कंपनी देगी Maruti Alto K10, साथ मिलेगी मनी बैक गारंटी
मिथुन और तुला जातकों पर है शनि ढैय्या, जानिए शनि के प्रकोप से बचने के ज्योतिषीय उपाय
शुक्र का राशि परिवर्तन इन 4 राशियों की बढ़ा सकता है मुश्किलें, धन हानि की आशंका
अगस्त महीना इन 4 राशि वालों के लिए हो सकता है मुश्किल, धन हानि के बन रहे योग
Horoscope Today, 31 August 2021: मेष राशि वालोंं के लिए आज का दिन शानदार, जानें अन्‍य राशियों का हाल
Numerology September 2021: अपनी बर्थ डेट से जानिए सितंबर महीने का भविष्यफल
सितंबर महीने में इन 5 राशियों पर रहेगी शनि की नजर, इनमें से 2 राशियों के बढ़ेंगे कष्ट
नींव हिली तो भवन का गिरना तय
‘जिद्दी’ सरकार और ‘अड़ियल’ विपक्ष
पाने से ज्यादा ‘आजादी’ बचाना मुश्किल
राजनेताओं पर कितना प्रभावी उड़ीसा उच्च न्यायालय का निर्णय?
भारतीय वैज्ञानिकों ने खोजे तीन विशाल ‘ब्लैक होल’
Amazon पर मिल रहा है Vivo का ये रिफर्बिश्ड 5G फोन, ब्रांड न्यू से कम है कीमत
Redmi से लेकर OPPO तक, ये हैं 5G फोन, 13999 रुपये है शुरुआती कीमत, जानें फुल स्पेसिफिकेशन
TVS Motors ने लॉन्च किया Apache RR 310 का अपडेट वर्जन, जानें कीमत और फीचर्स की पूरी डिटेल
टॉप 3 CNG कारें जो देती हैं कम बजट में दमदार माइलेज, पढ़ें कीमत से लेकर फीचर्स तक पूरी डिटेल
Honda X Blade vs TVS Apache 160, कौन है माइलेज वाली स्टाइलिश स्पोर्ट्स बाइक, जानें यहां
असदुद्दीन ओवैसी को जब UPA की सरकार में कर लिया गया था गिरफ्तार, इस कांग्रेसी नेता की मदद से आए थे बाहर
प्रेग्नेंसी के दौरान Gestational Diabetes से बचने के लिए रखें इन 3 बातों का ख्याल
स‍िर फोड़ने की बात करने वाले एसडीएम से मेरा कोई संबंध नहीं- BJP सांसद ने दी सफाई, कानूनी कार्रवाई की चेतावनी भी
Blood Pressure के मरीज डाइट में शामिल करें पोटैशियम से भरपूर ये 5 फूड्स, जानिये
Blood Sugar कंट्रोल करने में मददगार साबित हो सकता है इन 5 हेल्दी कार्ब्स का सेवन, जानिये
पेट और पीठ में दर्द हो सकते हैं किडनी स्टोन के लक्षण, एक्सपर्ट से जानिये कारण और बचाव के उपाय
SBI Recruitment 2021: स्टेट बैंक में इन पदों पर निकलीं नौकरी, यहां करें ऑनलाइन आवेदन
UPSC: कभी इंजीनियरिंग में फेल होने वाले हिमांशु आज हैं IAS अधिकारी, पहले प्रयास में ही ऐसे पाई थी सफलता
RRB Group D 2021 Exam Date, Admit Card LIVE Updates: आरआरबी ग्रुप डी के एडमिट कार्ड, यहां से कर पाएंगे ट्रेवल पास डाउनलोड
Police Constable Admit Card 2021: कांस्टेबल एग्जाम के एडमिट कार्ड इस तारीख को होंगे जारी
Principal Recruitment 2021: आयोग ने जारी की प्रिंसिपल के रिक्त पदों के लिए नोटिफिकेशन, 56 हजार तक मिलेगी सैलरी
RPSC Notice 2021:‌ इन पदों पर भर्ती के लिए इंटरव्यू का नोटिस जारी, इन कैंडिडेट्स के लिए ज़रूरी
भैंस चराई, प्राइवेट नौकरी की और फिर शादी के खिलाफ की बगावत! तब जाकर IAS बनीं वनमती
पति-पत्नी दोनों हैं IAS, फिर भी बेटे का कराया था आंगनबाड़ी में एडमिशन, कुछ ऐसी है स्वाति भदौरिया की कहानी
तालिबान का फरमान! वैज्ञानिक शिक्षा से धर्म बाहर, लोगों को हुआ नुकसान, इस्लाम विरोधी पढ़ाई होगी ‘शुद्ध’
दिल्ली के कनॉट प्लेस की दुकानों के बराबर है पाकिस्तान की इकोनॉमी  – कमर चीमा से बोले संबित पात्रा, कहा – गधों पर निर्भर हैं आप लोग
महाराष्ट्र सरकार अगर शराब की दुकानें खोल सकती है तो मंदिर क्यों नहीं – बोले अन्ना हजारे, आने लगे ऐसे कमेंट
किसानों का सिर फोड़ने का आदेश देने वाले SDM के समर्थन में उतरे फिल्ममेकर, लोग करने लगे ऐसे कमेंट
>>> url.urlretrieve("https://www.jansatta.com/wp-content/uploads/2021/08/America-afganishtan.jpg?w=310&h=174&crop=1", "img_1.jpg")
('img_1.jpg', <http.client.HTTPMessage object at 0x0000023BFE466D90>)
>>> url.urlretrieve("https://pwdown.com/12524/Govinda%20Aala%20Re%20(DJ%20Akhil%20Talreja%20Tapori%20Mix%203).mp3", 'song_1.mp3')
Traceback (most recent call last):
  File "<pyshell#16>", line 1, in <module>
    url.urlretrieve("https://pwdown.com/12524/Govinda%20Aala%20Re%20(DJ%20Akhil%20Talreja%20Tapori%20Mix%203).mp3", 'song_1.mp3')
  File "C:\Python38\lib\urllib\request.py", line 247, in urlretrieve
    with contextlib.closing(urlopen(url, data)) as fp:
  File "C:\Python38\lib\urllib\request.py", line 222, in urlopen
    return opener.open(url, data, timeout)
  File "C:\Python38\lib\urllib\request.py", line 531, in open
    response = meth(req, response)
  File "C:\Python38\lib\urllib\request.py", line 640, in http_response
    response = self.parent.error(
  File "C:\Python38\lib\urllib\request.py", line 563, in error
    result = self._call_chain(*args)
  File "C:\Python38\lib\urllib\request.py", line 502, in _call_chain
    result = func(*args)
  File "C:\Python38\lib\urllib\request.py", line 755, in http_error_302
    return self.parent.open(new, timeout=req.timeout)
  File "C:\Python38\lib\urllib\request.py", line 531, in open
    response = meth(req, response)
  File "C:\Python38\lib\urllib\request.py", line 640, in http_response
    response = self.parent.error(
  File "C:\Python38\lib\urllib\request.py", line 569, in error
    return self._call_chain(*args)
  File "C:\Python38\lib\urllib\request.py", line 502, in _call_chain
    result = func(*args)
  File "C:\Python38\lib\urllib\request.py", line 649, in http_error_default
    raise HTTPError(req.full_url, code, msg, hdrs, fp)
urllib.error.HTTPError: HTTP Error 403: Forbidden
>>> url.urlretrieve("https://pwdown.com/12524/Govinda%20Aala%20Re%20(DJ%20Akhil%20Talreja%20Tapori%20Mix%203).mp3", 'song_1.mp3')
Traceback (most recent call last):
  File "<pyshell#17>", line 1, in <module>
    url.urlretrieve("https://pwdown.com/12524/Govinda%20Aala%20Re%20(DJ%20Akhil%20Talreja%20Tapori%20Mix%203).mp3", 'song_1.mp3')
  File "C:\Python38\lib\urllib\request.py", line 247, in urlretrieve
    with contextlib.closing(urlopen(url, data)) as fp:
  File "C:\Python38\lib\urllib\request.py", line 222, in urlopen
    return opener.open(url, data, timeout)
  File "C:\Python38\lib\urllib\request.py", line 531, in open
    response = meth(req, response)
  File "C:\Python38\lib\urllib\request.py", line 640, in http_response
    response = self.parent.error(
  File "C:\Python38\lib\urllib\request.py", line 563, in error
    result = self._call_chain(*args)
  File "C:\Python38\lib\urllib\request.py", line 502, in _call_chain
    result = func(*args)
  File "C:\Python38\lib\urllib\request.py", line 755, in http_error_302
    return self.parent.open(new, timeout=req.timeout)
  File "C:\Python38\lib\urllib\request.py", line 531, in open
    response = meth(req, response)
  File "C:\Python38\lib\urllib\request.py", line 640, in http_response
    response = self.parent.error(
  File "C:\Python38\lib\urllib\request.py", line 569, in error
    return self._call_chain(*args)
  File "C:\Python38\lib\urllib\request.py", line 502, in _call_chain
    result = func(*args)
  File "C:\Python38\lib\urllib\request.py", line 649, in http_error_default
    raise HTTPError(req.full_url, code, msg, hdrs, fp)
urllib.error.HTTPError: HTTP Error 403: Forbidden
>>> 